# casks install directory
cask_args appdir: '/Applications'

# formulae
brew 'bat'
brew 'eza' # exa fork
brew 'fd'
brew 'fish'
brew 'fzy' # fzf alternative
brew 'git'
brew 'htop'
brew 'ical-buddy'
brew 'imagemagick'
brew 'jq'
brew 'jtbl'
brew 'mas'
brew 'ouch'
brew 'riff'
brew 'ripgrep'
brew 'slides'
brew 'starship'
brew 'stow'
brew 'tealdeer' # tldr
brew 'thefuck'
brew 'zoxide'

# dev tools
brew 'go'
brew 'python3'
brew 'rustup'
brew 'rustup-init'

# lsp
brew 'marksman'
brew 'rust-analyzer'
brew 'taplo'

# casks
cask 'arc'
cask 'discord'
cask 'font-agave-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'wezterm'
cask 'xmind'

# app store
mas 'Color Picker', id: 1545870783
mas 'Hidden Bar', id: 1452453066
mas 'Velja', id: 1607635845
mas 'Xcode', id: 497799835
