# casks install directory
cask_args appdir: '/Applications'

# formulae
brew 'bat'
brew 'dive'
brew 'eza' # exa fork
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'gitleaks'
brew 'gitoxide'
brew 'glow'
brew 'gum'
brew 'htop'
brew 'ical-buddy'
brew 'imagemagick'
brew 'jq'
brew 'mas'
brew 'mpv'
brew 'ouch'
brew 'peco'
brew 'riff'
brew 'ripgrep'
brew 'ripsecrets'
brew 'slides'
brew 'starship'
brew 'stow'
brew 'tealdeer'
brew 'thefuck'
brew 'tokei'
brew 'yq'
brew 'zoxide'

# dev tools
brew 'go'
brew 'python3'
brew 'rustup'
brew 'rustup-init'

# lsp
brew 'marksman'
brew 'rust-analyzer'
brew 'taplo'

# casks
cask 'discord'
cask 'font-agave-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'google-chrome'
cask 'rectangle'
cask 'slack'
cask 'wezterm'
cask 'xmind'
cask 'zed'

# app store
mas 'Color Picker', id: 1545870783
mas 'Ghostery - Privacy Ad Blocker', id: 1436953057
mas 'Hidden Bar', id: 1452453066
mas 'Today', id: 6443714928
mas 'Velja', id: 1607635845
mas 'Xcode', id: 497799835
