# casks install directory
cask_args appdir: '/Applications'

# formulae
brew 'apktool' # android apk tool
brew 'bandwhich' # network bandwidth monitor
brew 'cariddi' # web crawler and endpoint finder
brew 'dive' # docker image layer explorer
brew 'duf' # disk usage utility
brew 'eza' # modern ls replacement
brew 'fish' # friendly shell
brew 'fzy' # fuzzy finder
brew 'gh' # github cli
brew 'git' # version control
brew 'gitleaks' # secret scanner
brew 'ical-buddy' # apple calendar and reminders
brew 'jq' # json processor
brew 'marksman' # markdown lsp
brew 'mas' # app store cli
brew 'python3' # python 3
brew 'riff' # diff tool
brew 'ripgrep' # fast grep alternative
brew 'ripsecrets' # secret scanner
brew 'rust-analyzer' # rust lsp
brew 'rustup-init' # rust toolchain installer
brew 'starship' # shell prompt
brew 'stow' # dotfile manager
brew 'taplo' # toml toolkit
brew 'tealdeer' # tldr pages
brew 'uv' # python package installer
brew 'yq' # yaml processor
brew 'zoxide' # smart cd

# casks
cask 'claude' # ai assistant
cask 'claude-code' # ai coding assistant
cask 'discord' # chat platform
cask 'font-jetbrains-mono-nerd-font' # coding font
cask 'font-victor-mono-nerd-font' # coding font
cask 'orbstack' # docker alternative
cask 'rectangle' # window manager
cask 'wezterm' # terminal emulator
cask 'zed' # code editor

# app store
mas 'Hidden Bar', id: 1452453066
# mas 'Velja', id: 1607635845
# mas 'Wipr', id: 1662217862
# mas 'Xcode', id: 497799835
